Revit 2027 API
ProgressChangedEventArgs.Position Property
 Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Position { get; }
Public ReadOnly Property Position As Integer
	Get
public:
property int Position {
	int get ();
}
member Position : int with get
Property Value
Int32
See Also
Reference
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace